; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_3 ?v3 - type_2 ?v8 - type_3)
 	      (pred_1 ?v7 - object ?v8 - type_3)
	      (pred_4 ?v3 - type_2 ?v4 - type_1)
	      (pred_2 ?v3 - type_2 ?v7 - object ?v4 - type_1))

   (:action op_2
       :parameters  (?v3 - type_2 ?v6 ?v2 - type_3)
       :precondition (and  (pred_3 ?v3 ?v6))
       :effect (and  (pred_3 ?v3 ?v2)
		     (not (pred_3 ?v3 ?v6))))

   (:action op_1
       :parameters (?v3 - type_2 ?v1 - object ?v5 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_1 ?v1 ?v5) (pred_3 ?v3 ?v5) (pred_4 ?v3 ?v4))
       :effect (and (pred_2 ?v3 ?v1 ?v4)
		    (not (pred_1 ?v1 ?v5)) 
		    (not (pred_4 ?v3 ?v4))))

   (:action op_3
       :parameters (?v3 - type_2 ?v1 - object ?v5 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_2 ?v3 ?v1 ?v4) (pred_3 ?v3 ?v5))
       :effect (and (pred_1 ?v1 ?v5)
		    (pred_4 ?v3 ?v4)
		    (not (pred_2 ?v3 ?v1 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_06 obj_03 - type_2
obj_13 obj_11 obj_07 obj_14 - type_1
obj_05 obj_10 obj_08 obj_09 - type_3
obj_12 obj_01 obj_04 obj_02 - object)
(:init
(pred_3 obj_06 obj_10)
(pred_4 obj_06 obj_13)
(pred_4 obj_06 obj_11)
(pred_3 obj_03 obj_09)
(pred_4 obj_03 obj_07)
(pred_4 obj_03 obj_14)
(pred_1 obj_12 obj_09)
(pred_1 obj_01 obj_05)
(pred_1 obj_04 obj_09)
(pred_1 obj_02 obj_09)
)
(:goal
(and
(pred_1 obj_12 obj_08)
(pred_1 obj_01 obj_09)
(pred_1 obj_04 obj_10)
(pred_1 obj_02 obj_05)
)
)

(:constraints
  (always (not (pred_3 obj_06 obj_08)))
)
)

; plan
1. (op_2 obj_06 obj_10 obj_05)
   deleted: (pred_3 obj_06 obj_10)
   added: (pred_3 obj_06 obj_05)
   goals met: 0 of 4
2. (op_1 obj_03 obj_04 obj_09 obj_14)
   deleted: (pred_1 obj_04 obj_09) (pred_4 obj_03 obj_14)
   added: (pred_2 obj_03 obj_04 obj_14)
   goals met: 0 of 4
3. (op_1 obj_03 obj_12 obj_09 obj_07)
   deleted: (pred_1 obj_12 obj_09) (pred_4 obj_03 obj_07)
   added: (pred_2 obj_03 obj_12 obj_07)
   goals met: 0 of 4
4. (op_2 obj_03 obj_09 obj_08)
   deleted: (pred_3 obj_03 obj_09)
   added: (pred_3 obj_03 obj_08)
   goals met: 0 of 4
5. (op_1 obj_06 obj_01 obj_05 obj_11)
   deleted: (pred_1 obj_01 obj_05) (pred_4 obj_06 obj_11)
   added: (pred_2 obj_06 obj_01 obj_11)
   goals met: 0 of 4
6. (op_3 obj_03 obj_12 obj_08 obj_07)
   deleted: (pred_2 obj_03 obj_12 obj_07)
   added: (pred_1 obj_12 obj_08) (pred_4 obj_03 obj_07)
   goals met: 1 of 4
7. (op_2 obj_06 obj_05 obj_09)
   deleted: (pred_3 obj_06 obj_05)
   added: (pred_3 obj_06 obj_09)
   goals met: 1 of 4
8. (op_2 obj_03 obj_08 obj_10)
   deleted: (pred_3 obj_03 obj_08)
   added: (pred_3 obj_03 obj_10)
   goals met: 1 of 4
9. (op_3 obj_06 obj_01 obj_09 obj_11)
   deleted: (pred_2 obj_06 obj_01 obj_11)
   added: (pred_1 obj_01 obj_09) (pred_4 obj_06 obj_11)
   goals met: 2 of 4
10. (op_1 obj_06 obj_02 obj_09 obj_13)
   deleted: (pred_1 obj_02 obj_09) (pred_4 obj_06 obj_13)
   added: (pred_2 obj_06 obj_02 obj_13)
   goals met: 2 of 4
11. (op_3 obj_03 obj_04 obj_10 obj_14)
   deleted: (pred_2 obj_03 obj_04 obj_14)
   added: (pred_1 obj_04 obj_10) (pred_4 obj_03 obj_14)
   goals met: 3 of 4
12. (op_2 obj_06 obj_09 obj_05)
   deleted: (pred_3 obj_06 obj_09)
   added: (pred_3 obj_06 obj_05)
   goals met: 3 of 4
13. (op_3 obj_06 obj_02 obj_05 obj_13)
   deleted: (pred_2 obj_06 obj_02 obj_13)
   added: (pred_1 obj_02 obj_05) (pred_4 obj_06 obj_13)
   goals met: 4 of 4
